; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-11)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room4)
(at ball11 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
)
)
)

; plan
1. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 2 of 11
2. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 2 of 11
3. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 2 of 11
4. (drop ball4 room4 right)
   deleted: (carry ball4 right)
   added: (at ball4 room4) (free right)
   goals met: 3 of 11
5. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 4 of 11
6. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 4 of 11
7. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 4 of 11
8. (pick ball6 roomb right)
   deleted: (at ball6 roomb) (free right)
   added: (carry ball6 right)
   goals met: 4 of 11
9. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 4 of 11
10. (drop ball6 room4 right)
   deleted: (carry ball6 right)
   added: (at ball6 room4) (free right)
   goals met: 5 of 11
11. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 6 of 11
12. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 6 of 11
13. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 6 of 11
14. (pick ball8 room3 right)
   deleted: (at ball8 room3) (free right)
   added: (carry ball8 right)
   goals met: 6 of 11
15. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 6 of 11
16. (drop ball8 room4 right)
   deleted: (carry ball8 right)
   added: (at ball8 room4) (free right)
   goals met: 7 of 11
17. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 8 of 11
18. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 8 of 11
19. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 8 of 11
20. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 8 of 11
21. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 8 of 11
22. (drop ball2 room4 right)
   deleted: (carry ball2 right)
   added: (at ball2 room4) (free right)
   goals met: 9 of 11
23. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 10 of 11
24. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 10 of 11
25. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 10 of 11
26. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 10 of 11
27. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 11 of 11
